app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
  def index
    @song = Song.all

INSERT INTO "songs" ("album", "artist", "created_at", "image", "length", "number", "petition", "title", "updated_at", "user_id", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @song = Song.create(params[:song])